In [1]:
from pyspark.sql import SparkSession
import pyspark.pandas as ps
import datetime as dt
from src.emulator import generate_transactions_table
from src.emulator import generate_customer_profiles_table
from src.emulator import generate_terminal_profiles_table
from src.emulator import get_list_terminals_within_radius
from src.emulator import generate_dataset, add_frauds

WARNING:root:'PYARROW_IGNORE_TIMEZONE' environment variable was not set. It is required to set this environment variable to '1' in both driver and executor sides if you use pyarrow>=2.0.0. pandas-on-Spark will set it for you but it does not work if there is a Spark context already launched.

In [2]:
n_customers = 5
customer_profiles_table = generate_customer_profiles_table(n_customers, random_state = 0)
customer_profiles_table

,CUSTOMER_ID,x_customer_id,y_customer_id,mean_amount,std_amount,mean_nb_tx_per_day
0,0,54.881350,71.518937,62.262521,31.131260,2.179533
1,1,42.365480,64.589411,46.570785,23.285393,3.567092
2,2,96.366276,38.344152,80.213879,40.106939,2.115580
3,3,56.804456,92.559664,11.748426,5.874213,0.348517
4,4,2.021840,83.261985,78.924891,39.462446,3.480049

In [3]:
n_terminals = 5
terminal_profiles_table = generate_terminal_profiles_table(n_terminals, random_state = 0)
terminal_profiles_table

   TERMINAL_ID  x_terminal_id  y_terminal_id
0            0      54.881350      71.518937
1            1      60.276338      54.488318
2            2      42.365480      64.589411
3            3      43.758721      89.177300
4            4      96.366276      38.344152

In [4]:
# We first get the geographical locations of all terminals as a numpy array
x_y_terminals = terminal_profiles_table[['x_terminal_id','y_terminal_id']].values.astype(float)
# And get the list of terminals within radius of $50$ for the last customer
get_list_terminals_within_radius(customer_profiles_table.iloc[4], x_y_terminals=x_y_terminals, r=50)

[2, 3]

In [5]:
customer_profiles_table['available_terminals']=customer_profiles_table.apply(lambda x : get_list_terminals_within_radius(x, x_y_terminals=x_y_terminals, r=50), axis=1)
customer_profiles_table

,CUSTOMER_ID,x_customer_id,y_customer_id,mean_amount,std_amount,mean_nb_tx_per_day,available_terminals
0,0,54.881350,71.518937,62.262521,31.131260,2.179533,"[0, 1, 2, 3]"
1,1,42.365480,64.589411,46.570785,23.285393,3.567092,"[0, 1, 2, 3]"
2,2,96.366276,38.344152,80.213879,40.106939,2.115580,"[1, 4]"
3,3,56.804456,92.559664,11.748426,5.874213,0.348517,"[0, 1, 2, 3]"
4,4,2.021840,83.261985,78.924891,39.462446,3.480049,"[2, 3]"

In [6]:
transaction_table_customer_0=generate_transactions_table(customer_profiles_table.iloc[0], 
                                                         start_date = "2018-04-01", 
                                                         nb_days = 5)
transaction_table_customer_0

,TX_DATETIME,CUSTOMER_ID,TERMINAL_ID,TX_AMOUNT,TX_TIME_SECONDS,TX_TIME_DAYS
0,2018-04-01 07:19:05,0,3,123.59,26345,0
1,2018-04-01 19:02:02,0,3,46.51,68522,0
2,2018-04-01 18:00:16,0,0,77.34,64816,0
3,2018-04-02 15:13:02,0,2,32.35,141182,1
4,2018-04-02 14:05:38,0,3,63.30,137138,1
5,2018-04-02 15:46:51,0,3,13.59,143211,1
6,2018-04-02 08:51:06,0,2,54.72,118266,1
7,2018-04-02 20:24:47,0,3,51.89,159887,1
8,2018-04-03 12:15:47,0,2,117.91,216947,2
9,2018-04-03 08:50:09,0,1,67.72,204609,2
10,2018-04-03 09:25:49,0,1,28.46,206749,2
11,2018-04-03 15:33:14,0,2,50.25,228794,2
12,2018-04-03 07:41:24,0,1,93.26,200484,2
13,2018-04-04 01:15:35,0,0,46.40,263735,3
14,2018-04-04 09:33:58,0,2,23.26,293638,3
15,2018-04-05 16:19:09,0,1,71.96,404349,4
16,2018-04-05 07:41:19,0,2,52.69,373279,4

In [8]:
spark = SparkSession.builder.master("yarn").config("spark.yarn.queue", "dev").getOrCreate()

22/10/09 14:23:38 WARN SparkContext: Another SparkContext is being constructed (or threw an exception in its constructor). This may indicate an error, since only one SparkContext should be running in this JVM (see SPARK-2243). The other SparkContext was created at:
org.apache.spark.api.java.JavaSparkContext.<init>(JavaSparkContext.scala:58)
java.base/jdk.internal.reflect.NativeConstructorAccessorImpl.newInstance0(Native Method)
java.base/jdk.internal.reflect.NativeConstructorAccessorImpl.newInstance(NativeConstructorAccessorImpl.java:62)
java.base/jdk.internal.reflect.DelegatingConstructorAccessorImpl.newInstance(DelegatingConstructorAccessorImpl.java:45)
java.base/java.lang.reflect.Constructor.newInstance(Constructor.java:490)
py4j.reflection.MethodInvoker.invoke(MethodInvoker.java:247)
py4j.reflection.ReflectionEngine.invoke(ReflectionEngine.java:357)
py4j.Gateway.invoke(Gateway.java:238)
py4j.commands.ConstructorCommand.invokeConstructor(ConstructorCommand.java:80)
py4j.commands.ConstructorCommand.execute(ConstructorCommand.java:69)
py4j.ClientServerConnection.waitForCommands(ClientServerConnection.java:182)
py4j.ClientServerConnection.run(ClientServerConnection.java:106)
java.base/java.lang.Thread.run(Thread.java:829)
22/10/09 14:23:39 WARN Client: Neither spark.yarn.jars nor spark.yarn.archive is set, falling back to uploading libraries under SPARK_HOME.

In [9]:
(customer_profiles_table_df, terminal_profiles_table_df, transactions_df)=\
    generate_dataset(n_customers = 5000, 
                     n_terminals = 10000, 
                     nb_days=250, 
                     start_date=dt.date(year=2021, month=1, day=1).isoformat(), 
                     r=5)

transactions_sdf=spark.createDataFrame(transactions_df) 
transactions_sdf.write.mode("append").parquet("hdfs:///card-fraud-detection/transactions.parquet")

terminal_profiles_table_sdf=spark.createDataFrame(terminal_profiles_table_df) 
terminal_profiles_table_sdf.write.mode("append").parquet("hdfs:///card-fraud-detection/customer_profiles_table.parquet")

terminal_profiles_table_sdf=spark.createDataFrame(terminal_profiles_table_df) 
terminal_profiles_table_sdf.write.mode("append").parquet("hdfs:///card-fraud-detection/terminal_profiles_table.parquet")

Time to generate customer profiles table: 0.22s
Time to generate terminal profiles table: 0.07s
Time to associate terminals to customers: 2.3s
Time to generate transactions: 9.1e+01s
22/10/09 14:27:18 WARN TaskSetManager: Stage 0 contains a task of very large size (45432 KiB). The maximum recommended task size is 1000 KiB.

In [10]:
transactions_sdf.count()

22/10/09 14:27:27 WARN TaskSetManager: Stage 3 contains a task of very large size (45432 KiB). The maximum recommended task size is 1000 KiB.

2395956

In [11]:
spark.stop()